; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v13 ?v2)
             (pred_4 ?v5 ?v12)
             (pred_3 ?v13 ?v12)
             (pred_7 ?v1 ?v13 )
	     (pred_11 ?v13)
             (pred_10 ?v4)
             (pred_1 ?v5)
             (pred_2 ?v12)
             (pred_12 ?v13)
             (pred_5 ?v5)
             (pred_6 ?v13)
             (pred_8 ))



(:action op_1
:parameters (?v11 ?v6 ?v3 ?v10)
:precondition (and (pred_10 ?v11) (pred_10 ?v6) (pred_1 ?v3) (pred_2 ?v10)
          (pred_9 ?v11 ?v6) (pred_4 ?v3 ?v10)
                   (pred_3 ?v6 ?v10) (pred_11 ?v11) 
                   (pred_12 ?v6) (pred_5 ?v3))
:effect (and  (pred_6 ?v6) (not (pred_12 ?v6))))


(:action op_2
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_10 ?v8)
               (pred_11 ?v11) (pred_9 ?v11 ?v8) (pred_6 ?v8))
:effect (and (pred_11 ?v8) (not (pred_11 ?v11))))

(:action op_3
:parameters (?v11 ?v3)
:precondition (and (pred_10 ?v11) (pred_1 ?v3) 
                  (pred_11 ?v11) (pred_7 ?v3 ?v11) (pred_8 ))
:effect (and (pred_5 ?v3)
   (not (pred_7 ?v3 ?v11)) (not (pred_8 ))))


(:action op_4
:parameters (?v11 ?v9 ?v7)
:precondition (and (pred_10 ?v11) (pred_1 ?v9) (pred_1 ?v7)
                  (pred_11 ?v11) (pred_5 ?v7) (pred_7 ?v9 ?v11))
:effect (and (pred_5 ?v9) (pred_7 ?v7 ?v11)
        (not (pred_5 ?v7)) (not (pred_7 ?v9 ?v11))))

(:action op_5
:parameters (?v11 ?v3)
:precondition (and (pred_10 ?v11) (pred_1 ?v3) 
                  (pred_11 ?v11) (pred_5 ?v3))
:effect (and (pred_8 ) (pred_7 ?v3 ?v11) (not (pred_5 ?v3)))))

; problem
(define (problem grid-2-2-1-1-1)
    (:domain grid)
    (:objects
    obj_06 obj_03 obj_02 obj_04
    obj_05
    obj_01
    )

    (:init
       (pred_8)

       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_2 obj_05)
       (pred_1 obj_01)

       (pred_9 obj_06 obj_02)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_03 obj_04)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_06)
       (pred_9 obj_04 obj_03)
       (pred_9 obj_04 obj_02)
       (pred_12 obj_02)
       (pred_3  obj_02 obj_05)
       (pred_6 obj_06)
       (pred_6 obj_03)
       (pred_6 obj_04)

       (pred_4  obj_01 obj_05)
       (pred_7 obj_01 obj_03)
       (pred_11 obj_03)
    )

    (:goal (and
       (pred_7 obj_01 obj_02)
    ))
(:constraints
  (always (not (pred_11 obj_06)))
)
)

; plan
1. (op_3 obj_03 obj_01)
   deleted: (pred_7 obj_01 obj_03) (pred_8)
   added: (pred_5 obj_01)
   goals met: 0 of 1
2. (op_2 obj_03 obj_04)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_04)
   goals met: 0 of 1
3. (op_1 obj_04 obj_02 obj_01 obj_05)
   deleted: (pred_12 obj_02)
   added: (pred_6 obj_02)
   goals met: 0 of 1
4. (op_2 obj_04 obj_02)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_01)
   deleted: (pred_5 obj_01)
   added: (pred_8) (pred_7 obj_01 obj_02)
   goals met: 1 of 1
